const state = {
    // 當前選擇日期
    currentDate: '2020-01-01',

    // 當前選擇的員工
    employee: 'ABC123',
    
    // 所有員工基本資訊 -> 名稱、編號
    employeeList: {},
    
    // 當前選擇日期的資訊
    dayInfo: {},
    
    // 當前員工的詳細資訊
    employeeInfo: {}

};

export default state;

/**
 * 需常打API
 * --
 * 所需資料
 * =====================================
 * 當前選擇日期
 * 當前選擇的員工
 * 所有員工基本資訊 -> 名稱、編號
 * -
 * 當前選擇日期的資訊
 * 當前員工的詳細資訊
 * =====================================
 */

/**
 * 不需常打API
 * --
 * 所需資料
 * =====================================
 * 當前選擇日期
 * 當前選擇的員工
 * 所有員工基本資訊 -> 名稱、編號
 * -
 * 當月的資訊
 * 所有員工的詳細資訊
 * =====================================
 */
