const state = {
    // 當前選擇日期
    currentDate: '',

    // 當前選擇的員工
    currentEmployee: '',

    // 預設的班別
    defaultClass: {},
    
    // 所有員工基本資訊 -> 名稱、編號
    employeesList: {},

    // 當前員工資料
    employeeInfo: {
        work: {
            '2020-09-01': 4,
            '2020-09-02': 4,
            '2020-09-03': 5,
            '2020-09-04': 6,
            '2020-09-05': 6,
            '2020-09-06': 4
        },
        off: [
            '2020-09-07',
            '2020-09-08',
            '2020-09-09',
            '2020-09-10',
        ]
    },
    
    // 當前選擇日期的資訊
    dayInfo: {
		4: [4,5,6],
		5: [5,6,7],
		6: [4,5,7]
	},

    // 國定假日
    holiday: [],

    // 當天日期
    today: ''
};

export default state;

/**
 * 需常打API
 * --
 * 所需資料
 * =====================================
 * 當前選擇日期
 * 當前選擇的員工
 * 所有員工基本資訊 -> 名稱、編號
 * -
 * 當前選擇日期的資訊
 * 當前員工的詳細資訊
 * =====================================
 */

/**
 * 不需常打API
 * --
 * 所需資料
 * =====================================
 * 當前選擇日期
 * 當前選擇的員工
 * 所有員工基本資訊 -> 名稱、編號
 * -
 * 當月的資訊
 * 所有員工的詳細資訊
 * =====================================
 */
