const state = {
    // 當前選擇日期
    currentDate: '',

    // 當前選擇的員工
    currentEmployee: '',

    // 預設的班別
    defaultClass: {},
    
    // 所有員工基本資訊 -> 名稱、編號
    employeesList: {
        4: {
            name: 'ted',
            id: '4'
        },
        6: {
            name: 'connor',
            id: '6'
        },
        5: {
            name: 'Jin',
            id: '5'
        },
        7: {
            name: 'test1',
            id: '7'
        },
        8: {
            name: 'test2',
            id: '8'
        },
        9: {
            name: 'test3',
            id: '9'
        },
        10: {
            name: 'test4',
            id: '10'
        },
        11: {
            name: 'test5',
            id: '11'
        },
        12: {
            name: 'test6',
            id: '12'
        }
    },
    
    // 當前選擇日期的資訊
    dayInfo: {},

    // 國定假日
    holiday: [],

    // 當天日期
    today: ''
};

export default state;

/**
 * 需常打API
 * --
 * 所需資料
 * =====================================
 * 當前選擇日期
 * 當前選擇的員工
 * 所有員工基本資訊 -> 名稱、編號
 * -
 * 當前選擇日期的資訊
 * 當前員工的詳細資訊
 * =====================================
 */

/**
 * 不需常打API
 * --
 * 所需資料
 * =====================================
 * 當前選擇日期
 * 當前選擇的員工
 * 所有員工基本資訊 -> 名稱、編號
 * -
 * 當月的資訊
 * 所有員工的詳細資訊
 * =====================================
 */
